app/controllers/books_controller.rb

INSERT INTO "books" ("title", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["title", "The Three-Body Problem"], ["created_at", "2021-09-03 20:10:06.187914"], ["updated_at", "2021-09-03 20:10:06.187914"]]
---
  def create
    @book = Book.new(book_params)

    respond_to do |format|
      if @book.save

SELECT "books".* FROM "books" WHERE "books"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
  def delete
    @book = Book.find((params[:id]))